---
kind: other
id: Properties.T:Autodesk.Revit.DB.TextElement
source: html/0faf243f-a4c0-00c9-b407-48891adfd457.htm
---
# TextElement Properties

The id of the assembly instance to which the element belongs.